translations = {
    'uk': {

        "Подписаться": "Підписатися",
        "7 дней": "7 днів",
        "10 дней": "10 днів",
        "<b>Настройки</b>": "<b>Налаштування</b>",
        "⚙️Настройки": "⚙️Налаштування",
        "📩Уведомления": "📩Повідомлення",
        "🌐Язык": "🌐Мова",
        "🏙Город": "🏙Місто",
        "Утро, день": "Ранок, день",
        "Отписаться": "Відписатися",
        "Главная": "Головна",
        "Уведомления о погоде будут приходить ежедневно в 7:00 и в 15:00": "Повідомлення про погоду будуть приходити кожного дня о 7:00 та 15:00",
        "Укажите время, когда присылать погодные уведомления": "Вкажіть час, коли надсилати погодні повідомлення",
        "Уведомления будут приходить в ": "Повідомлення будуть приходити в ",
        "Бот больше не будет отправлять уведомления о погоде": "Бот більше не буде надсилати повідомлення про погоду",
        "Привет! Я погодный бот. Я буду отправлять тебе погоду в нужное для тебя время": "Привіт! Я погодний бот. Я буду надсилати тобі прогноз погоди в потрібний для тебе час",
        "Введите название города": "Введіть назву міста",
        "Отсутствует": "Відсутня",
        "\n\n<b>Текущая</b>": "\n\n<b>Поточна</b>",
        "C (Ощущается как ": "C (Відчувається як ",
        "</u>\n\n🌀Давление: <u>": "</u>\n\n🌀Тиск: <u>",
        "💧Влажность: <u>": "💧Вологість: <u>",
        "💨Ветер: <u>": "💨Ветер: <u>",
        "</u>\n☔️Вероятность осадков: <u>": "</u>\n☔️Ймовірність опадів: <u>",
        "</u>\n\n\n<b>Дневная</b>\n": "</u>\n\n\n<b>Денна</b>\n",
        "Похоже вы указали город не правильно.\nПопробуйте ввести еще раз": "Схоже ви вказали місто не правильно\nСпробуйте ввести ще раз",
        "Укажите в какой период нужно отправлять уведомления о погоде": "Вкажіть в який період потрібно надсилати повідомлення про погоду",
        "<b>Главное меню</b>": "<b>Головне меню</b>",
        "Благодарим за подписку": "Дякую за підписку",
        "Укажи нужный город": "Вкажи потрібне місто",
        "Вы не подписались на канал": "Ви не підписались на канал",
        "Привет! Я погодный бот. Я буду отправлять тебе погоду в нужное для тебя время": "Привіт! Я погодний бот. Я буду надсилати тобі погоду в потрібний для тебе час",
        "Текущий язык: ": "Поточна мова: ",
        "\nВыберите язык: ": "\nОберіть мову: ",
        "Русский🇷🇺": "Російська🇷🇺",
        "Украинский🇺🇦": "Українська🇺🇦",
        "Английский🇬🇧": "Англійська🇬🇧",
        "Ваш язык успешно изменен на ": "Ваша мова успішно змінена на "



    },
    'us': {

        "Подписаться": "Subscribe",
        "7 дней": "7 days",
        "10 дней": "10 days",
        "Завтра": "Tomorrow",
        "<b>Настройки</b>": "<b>Settings</b>",
        "⚙️Настройки": "⚙️Settings",
        "📩Уведомления": "📩Message",
        "⬅️Назад": "⬅️Back",
        "🌐Язык": "🌐Language",
        "🏙Город": "🏙City",
        "⛅️Погода": "⛅️Weather",
        "Утро, день": "Morning, day",
        "Отписаться": "Unsubscribe",
        "На завтра": "For tomorrow",
        "Главная": "Menu",
        "Уведомления о погоде будут приходить ежедневно в 7:00 и в 15:00": "Weather alerts will come daily at 7:00 and 15:00",
        "Укажите время, когда присылать погодные уведомления": "Write the time when to send weather notifications",
        "Уведомления будут приходить в ": "Notices will come in ",
        "Бот больше не будет отправлять уведомления о погоде": "The bot will no longer send weather notifications",
        "Привет! Я погодный бот. Я буду отправлять тебе погоду в нужное для тебя время": "Hi! I am a weather bot. I will send you weather at the right time for you",
        "Введите название города": "Enter the city name",
        "Отсутствует": "Is absent",
        "\n\n<b>Текущая</b>": "\n\n<b>current</b>",
        "C (Ощущается как ": "C (Feels like ",
        "</u>\n\n🌀Давление: <u>": "</u>\n\n🌀Pressure: <u>",
        "💧Влажность: <u>": "💧Humidity: <u>",
        "💨Ветер: <u>": "💨Wind: <u>",
        "</u>\n☔️Вероятность осадков: <u>": "</u>\n☔️Chance of precipit: <u>",
        "</u>\n\n\n<b>Дневная</b>\n": "</u>\n\n\n<b>Daily</b>\n",
        "Похоже вы указали город не правильно.\nПопробуйте ввести еще раз": "Looks like you got the town wrong.\nTry entering again",
        "Укажите в какой период нужно отправлять уведомления о погоде": "Write in which period you want to send weather reports",
        "<b>Главное меню</b>": "<b>Main menu</b>",
        "Благодарим за подписку": "Thank you for subscribing",
        "Укажи нужный город": "Name the right city",
        "Вы не подписались на канал": "You have not subscribed to the channel",
        "Привет! Я погодный бот. Я буду отправлять тебе погоду в нужное для тебя время": "Hi! I am a weather bot. I will send you weather at the right time for you",
        "Текущий язык: ": "The current language: ",
        "\nВыберите язык: ": "\nChoose the language: ",
        "Русский🇷🇺": "Russian🇷🇺",
        "Украинский🇺🇦": "Ukrainian🇺🇦",
        "Английский🇬🇧": "English🇬🇧",
        "Ваш язык успешно изменен на ": "Your language has been successfully changed to "



    },

}

def _(text, lang='ru'):
  if lang == 'ru':
    return text
  else:
    global translations
    try:
      return translations[lang][text]
    except:
      return


